spec/dummy/app/controllers/users_controller.rb

  def update
    $stderr.puts(params.permit!.to_h)
    @user = User.find(params[:id])
    if @user.update_attributes params.require(:user).permit(:name, projects_attributes: [:id, :name, :description, :_destroy, todos_attributes: [:id, :description, :_destroy]])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "projects" SET "name" = 'new name' WHERE "projects"."id" = 1

  def create
    @user = User.new(params.require(:user).permit(:name, projects_attributes: [:name, :description, todos_attributes: [:description]]))
    if @user.save
---
INSERT INTO "projects" ("description", "name", "user_id") VALUES (?, ?, ?)  [["description", "p1 description"], ["name", "p1 name"], ["user_id", 1]]
INSERT INTO "todos" ("description", "model_with_todos_id", "model_with_todos_type") VALUES (?, ?, ?)  [["description", "todo text"], ["model_with_todos_id", 1], ["model_with_todos_type", "Project"]]
INSERT INTO "users" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Sun, 27 May 2012 09:14:34 UTC +00:00], ["name", "user name"], ["updated_at", Sun, 27 May 2012 09:14:34 UTC +00:00]]